{
    "reviews": [
      {
        "professor": "Dr. John Smith",
        "subject": "Computer Science",
        "review": "Dr. Smith is an excellent professor who explains complex algorithms in a simple way. His lectures are always engaging.",
        "stars": 5
      },
      {
        "professor": "Prof. Linda Johnson",
        "subject": "Mathematics",
        "review": "Prof. Johnson is very knowledgeable, but her lectures can be hard to follow sometimes. She expects a lot from her students.",
        "stars": 4
      },
      {
        "professor": "Dr. James Williams",
        "subject": "Data Structures",
        "review": "Dr. Williams is a decent professor, but his exams are extremely difficult. The homework assignments are helpful, though.",
        "stars": 3
      },
      {
        "professor": "Prof. Emily Brown",
        "subject": "History",
        "review": "Prof. Brown is very passionate about history. She brings the subject to life with her stories and examples. Highly recommend her class!",
        "stars": 5
      },
      {
        "professor": "Dr. Michael Davis",
        "subject": "Chemistry",
        "review": "Dr. Davis is a tough grader, but his lectures are clear and well-organized. You'll learn a lot if you put in the effort.",
        "stars": 4
      },
      {
        "professor": "Prof. Susan Wilson",
        "subject": "Literature",
        "review": "Prof. Wilson's classes are interesting, but she can be a bit strict with deadlines. She provides great feedback on essays.",
        "stars": 4
      },
      {
        "professor": "Dr. David Martinez",
        "subject": "Philosophy",
        "review": "Dr. Martinez is a brilliant thinker, but his lectures can be confusing. The readings are heavy, but worth it.",
        "stars": 3
      },
      {
        "professor": "Prof. Karen Lee",
        "subject": "Economics",
        "review": "Prof. Lee is an amazing professor who makes economics fun. Her exams are fair, and she is always willing to help students outside of class.",
        "stars": 5
      },
      {
        "professor": "Dr. Robert Garcia",
        "subject": "Biology",
        "review": "Dr. Garcia is very enthusiastic about biology, but his lectures can be a bit dry. He is approachable and helps students understand difficult concepts.",
        "stars": 4
      },
      {
        "professor": "Prof. Anna Thompson",
        "subject": "Political Science",
        "review": "Prof. Thompson is very knowledgeable, but she can be hard to approach. Her lectures are informative, but not very engaging.",
        "stars": 3
      },
      {
        "professor": "Dr. Richard Adams",
        "subject": "Artificial Intelligence",
        "review": "Dr. Adams is a genius in AI, but his lectures can be overwhelming. You need to stay on top of the material.",
        "stars": 4
      },
      {
        "professor": "Prof. Jessica Evans",
        "subject": "Software Engineering",
        "review": "Prof. Evans is amazing at breaking down complex software development processes. Her assignments are challenging but rewarding.",
        "stars": 5
      },
      {
        "professor": "Dr. Mark Wilson",
        "subject": "Machine Learning",
        "review": "Dr. Wilson’s course is intense, but you will learn a lot about machine learning. Be prepared for heavy coding assignments.",
        "stars": 4
      },
      {
        "professor": "Prof. Laura Scott",
        "subject": "Human-Computer Interaction",
        "review": "Prof. Scott is very passionate about HCI. Her projects are hands-on and fun, and she encourages creativity.",
        "stars": 5
      },
      {
        "professor": "Dr. Daniel Young",
        "subject": "Computer Networks",
        "review": "Dr. Young is knowledgeable but expects students to be self-motivated. His exams are tough, but he prepares you well.",
        "stars": 4
      },
      {
        "professor": "Prof. Rachel Clark",
        "subject": "Operating Systems",
        "review": "Prof. Clark’s class is challenging, especially the coding assignments, but she’s very supportive and provides great feedback.",
        "stars": 4
      },
      {
        "professor": "Dr. Matthew White",
        "subject": "Database Systems",
        "review": "Dr. White is an excellent professor with a deep understanding of databases. His lectures are clear and well-structured.",
        "stars": 5
      },
      {
        "professor": "Prof. Samantha Baker",
        "subject": "Cybersecurity",
        "review": "Prof. Baker makes cybersecurity topics interesting. Her labs are practical and help reinforce the concepts taught in class.",
        "stars": 5
      },
      {
        "professor": "Dr. Andrew Green",
        "subject": "Algorithms",
        "review": "Dr. Green is a tough professor, but you’ll gain a strong foundation in algorithms. His problem sets are hard but rewarding.",
        "stars": 4
      },
      {
        "professor": "Prof. Olivia Hill",
        "subject": "Data Science",
        "review": "Prof. Hill is very approachable and helpful. Her assignments are practical, focusing on real-world data science problems.",
        "stars": 5
      }
    ]
  }
  